let data = [{text: "广东护理学会", value: "GD001"}, {text: "重庆护理学会", value: "CQ002"}, {text: "天津护理学会", value: "TJ003"}];

data = data.filter(item => {
        return item.value === "GD001"
    }
);

console.log("data", data);

let data1 = [
    {
        "会员姓名": "李逍遥",
        "会员登记号": "M051100001M",
        "性别": null,
        "联系手机": "18325302081",
        "联系电话": "0571-88771234",
        "电子邮件": "123@126.com",
        "身份证号码": "44098219931009277x",
        "省份": null,
        "城市": null,
        "区县": null,
        "工作单位": "浙江省人民医院",
        "职称": "护师",
        "职务": "无",
        "科室": "呼吸内科",
        "政治面貌": "中共党员",
        "宗教信仰": "道教",
        "通讯地址": "秋天路369号",
        "护士证号": null,
        "会员类别": null,
        "申请日期": "2022-01-01",
        "缴费有效期至": "2022-12-31",
        "学历": "本科",
        "民族": "汉族",
        "校验结果": "会员性别信息为空",
        "所属专业委员会或分会": "中华护理学会",
        "所在地区": "浙江省-杭州市-余杭区",
        "出生年": "1993",
        "出生月": "10",
        "出生日": "09",
        "证件类别": "中国大陆居民身份证",
        "学位": "学士",
        "专业": "护理专业",
        "所在学会任职": "无",
        "总会任职": "无",
        "人大、政协任职": "无",
        "民主党派任职": "无",
        "邮政编码": "311100",
        "已缴费年度": "1"
    }
]

for (let item of data1) {
    // 删除不需要的字段
    delete item.省份;
    delete item.城市;
    delete item.区县;
    delete item.会员类别;
    delete item.护士证号;
    // 对字段进行排序
    let newObject = {};
    Object.assign(newObject, {
        "所属专业委员会或分会": item["所属专业委员会或分会"],
        "会员登记号": item["会员登记号"],
        "会员姓名": item["会员姓名"],
        "所在地区": item["所在地区"],
        "性别": item["性别"],
        "民族": item["民族"],
        "政治面貌": item["政治面貌"],
        "宗教信仰": item["宗教信仰"],
        "出生年": item["出生年"],
        "出生月": item["出生月"],
        "出生日": item["出生日"],
        "证件类别": item["证件类别"],
        "身份证号码": item["身份证号码"],
        "学历": item["学历"],
        "学位": item["学位"],
        "专业": item["专业"],
        "职称": item["职称"],
        "科室": item["科室"],
        "所在学会任职": item["所在学会任职"],
        "人大、政协任职": item["人大、政协任职"],
        "民主党派任职": item["民主党派任职"],
        "工作单位": item["工作单位"],
        "通讯地址": item["通讯地址"],
        "邮政编码": item["邮政编码"],
        "联系电话": item["联系电话"],
        "联系手机": item["联系手机"],
        "申请日期": item["申请日期"],
        "缴费有效期至": item["缴费有效期至"],
        "已缴费年度": item["已缴费年度"],
    })
    console.log(newObject);
}
