export default [
    {
        value: '无',
        label: '无'
    },
    {
        value: '手术室护理专业委员会',
        label: '手术室护理专业委员会'
    },
    {
        value: '护理管理专业委员会',
        label: '护理管理专业委员会'
    },
    {
        value: '护理教育专业委员会',
        label: '护理教育专业委员会'
    },
    {
        value: '静脉治疗护理专业委员会',
        label: '静脉治疗护理专业委员会'
    },
    {
        value: '消毒供应护理专业委员会',
        label: '消毒供应护理专业委员会'
    },
    {
        value: '内科护理专业委员会',
        label: '内科护理专业委员会'
    },
    {
        value: '急诊护理专业委员会',
        label: '急诊护理专业委员会'
    },
    {
        value: '外科护理专业委员会',
        label: '外科护理专业委员会'
    },
    {
        value: '儿科护理专业委员会',
        label: '儿科护理专业委员会'
    },
    {
        value: '妇产科护理专业委员会',
        label: '妇产科护理专业委员会'
    },
    {
        value: '危重症护理专业委员会',
        label: '危重症护理专业委员会'
    },
    {
        value: '伤口、造口、失禁护理专业委员会',
        label: '伤口、造口、失禁护理专业委员会'
    },
    {
        value: '肿瘤护理专业委员会',
        label: '肿瘤护理专业委员会'
    },
    {
        value: '灾害护理专业委员会',
        label: '灾害护理专业委员会'
    },
    {
        value: '血液净化护理专业委员会',
        label: '血液净化护理专业委员会'
    },
    {
        value: '糖尿病护理专业委员会',
        label: '糖尿病护理专业委员会'
    },
    {
        value: '骨科护理专业委员会',
        label: '骨科护理专业委员会'
    },
    {
        value: '中医护理专业委员会',
        label: '中医护理专业委员会'
    },
    {
        value: '精神卫生心理专业委员会',
        label: '精神卫生心理专业委员会'
    },
    {
        value: '五官科护理专业委员会',
        label: '五官科护理专业委员会'
    },
    {
        value: '门诊护理专业委员会',
        label: '门诊护理专业委员会'
    },
    {
        value: '康复护理专业委员会',
        label: '康复护理专业委员会'
    },
    {
        value: '社区护理专业委员会',
        label: '社区护理专业委员会'
    },
    {
        value: '男护士工作委员会',
        label: '男护士工作委员会'
    },
    {
        value: '新生儿护理专业委员会',
        label: '新生儿护理专业委员会'
    },
    {
        value: '助产护理专业委员会',
        label: '助产护理专业委员会'
    },
    {
        value: '老年健康养护专业委员会',
        label: '老年健康养护专业委员会'
    },
    {
        value: '感染性疾病与感染控制护理专业委员会',
        label: '感染性疾病与感染控制护理专业委员会'
    },
    {
        value: '心血管护理专业委员会',
        label: '心血管护理专业委员会'
    },
    {
        value: '呼吸护理专业委员会',
        label: '呼吸护理专业委员会'
    },
    {
        value: '口腔护理专业委员会',
        label: '口腔护理专业委员会'
    }
]